#define _CRT_SECURE_NO_WARNINGS 1

//c语言数据的存储
#include<stdio.h>

//大端模式数据的低位保存在内存的高地址中，数据的高位保存在内存的低地址中
//小端模式数据的低位保存在内存的低地址中，数据的高位保存在内存的高位中
//int main() {
//	int a = 20;
//	int b = -10;
//
//	int y = 0x11223344;
//	return 0;
//
//}




//设计判断大小端函数
//int check_key() {
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1) {
//		return 1;
//	}
//	return 0;
//}
//
//
//int main() {
//	int ret = check_key();
//	if (ret == 1) {
//		printf("小端\n");
//	}
//	else
//		printf("大端\n");
//	return 0;
// }


//判断以下输出

//int main() {
//	char a = -1;
//	// 原码1000000000000000000000000000000000000001
//	//反码
//	//补码 1111111111111111111111111111111111111111
//
//	//char 取低位的8位 11111111
//	//输出要32位，左补符号位
//	//1111111111111111111111111111111111111111
//	signed char b = -1;
//
//	unsigned char c = -1;
//	//无符号位，左补0
//	//0000000000000000000000000000000011111111
//	printf("a= %d,b = %d,c = %d",a,b,c);//-1，-1,255
// 
// 
// 
// char a = -128;
// char a = 128;
// //char类型的128 与-128 无异，因为有符号char范围-128---127
// //此时的128等于127+1 回到-128
// 10000000000000000000000010000000
// 11111111111111111111111110000000   //补码
// 
// char类型10000000
// 后打印无符号的十进制数
// 
// 11111111111111111111111110000000  打印时无符号类型，认为就是正数
// printf("%u",a);
//	return 0;
//}